// В данном тексте изменить наименование дней недели на английский вариант. Например, строка
// "Старший братец ПОНЕДЕЛЬНИК ..." будет преобразована в "Старший братец MONDAY..."

let str = `Старший братец ПОНЕДЕЛЬНИК –
работяга, не бездельник.
Он неделю открывает
всех трудиться зазывает.

ВТОРНИК следует за братом
у него идей богато.

А потом СРЕДА-сестрица,
не пристало ей лениться.

Брат ЧЕТВЕРГ и так, и сяк,
он мечтательный чудак.

ПЯТНИЦА-сестра сумела
побыстрей закончить дело.

Предпоследний брат СУББОТА
не выходит на работу.

В гости ходит ВОСКРЕСЕНЬЕ,
очень любит угощенье
`;

const translationDayWeek = () => {
  return str
    .replace(/ПОНЕДЕЛЬНИК/g, "MONDAY")
    .replace(/ВТОРНИК/g, "TUESDAY")
    .replace(/СРЕДА/g, "WEDNESDAY")
    .replace(/ЧЕТВЕРГ/g, "THURSDAY")
    .replace(/ПЯТНИЦА/g, "FRIDAY")
    .replace(/СУББОТА/g, "SATURDAY")
    .replace(/ВОСКРЕСЕНЬЕ/g, "SUNDAY");
};

console.log(translationDayWeek(str));
